#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_member.sa[0] will be created
  + resource "google_project_iam_member" "sa" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/iam.serviceAccountUser"
    }

  # google_project_iam_member.sa[1] will be created
  + resource "google_project_iam_member" "sa" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/bigquery.jobUser"
    }

  # google_project_iam_member.sa[2] will be created
  + resource "google_project_iam_member" "sa" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/bigquery.dataEditor"
    }

  # google_project_iam_member.sa[3] will be created
  + resource "google_project_iam_member" "sa" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/cloudfunctions.developer"
    }

  # google_project_service.iam will be created
  + resource "google_project_service" "iam" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + service                    = "iam.googleapis.com"
    }

  # google_service_account.sa will be created
  + resource "google_service_account" "sa" {
      + account_id   = "sa-example-account"
      + display_name = "Example Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account_key.sa[0] will be created
  + resource "google_service_account_key" "sa" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
